MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define IPC0 IPC0
extern volatile uint16_t IPC0 __attribute__((__sfr__));
__extension__ typedef struct tagIPC0BITS {
  union {
    struct {
      uint16_t INT0IP:3;
      uint16_t :1;
      uint16_t IC1IP:3;
      uint16_t :1;
      uint16_t OC1IP:3;
      uint16_t :1;
      uint16_t T1IP:3;
    };
    struct {
      uint16_t INT0IP0:1;
      uint16_t INT0IP1:1;
      uint16_t INT0IP2:1;
      uint16_t :1;
      uint16_t IC1IP0:1;
      uint16_t IC1IP1:1;
      uint16_t IC1IP2:1;
      uint16_t :1;
      uint16_t OC1IP0:1;
      uint16_t OC1IP1:1;
      uint16_t OC1IP2:1;
      uint16_t :1;
      uint16_t T1IP0:1;
      uint16_t T1IP1:1;
      uint16_t T1IP2:1;
    };
  };
} IPC0BITS;
extern volatile IPC0BITS IPC0bits __attribute__((__sfr__));

#define IPC1 IPC1
extern volatile uint16_t IPC1 __attribute__((__sfr__));
__extension__ typedef struct tagIPC1BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t OC2IP:3;
      uint16_t :1;
      uint16_t T2IP:3;
      uint16_t :1;
      uint16_t T3IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t OC2IP0:1;
      uint16_t OC2IP1:1;
      uint16_t OC2IP2:1;
      uint16_t :1;
      uint16_t T2IP0:1;
      uint16_t T2IP1:1;
      uint16_t T2IP2:1;
      uint16_t :1;
      uint16_t T3IP0:1;
      uint16_t T3IP1:1;
      uint16_t T3IP2:1;
    };
  };
} IPC1BITS;
extern volatile IPC1BITS IPC1bits __attribute__((__sfr__));

#define IPC2 IPC2
extern volatile uint16_t IPC2 __attribute__((__sfr__));
__extension__ typedef struct tagIPC2BITS {
  union {
    struct {
      uint16_t SPI1IP:3;
      uint16_t :1;
      uint16_t U1RXIP:3;
      uint16_t :1;
      uint16_t U1TXIP:3;
      uint16_t :1;
      uint16_t ADIP:3;
    };
    struct {
      uint16_t SPI1IP0:1;
      uint16_t SPI1IP1:1;
      uint16_t SPI1IP2:1;
      uint16_t :1;
      uint16_t U1RXIP0:1;
      uint16_t U1RXIP1:1;
      uint16_t U1RXIP2:1;
      uint16_t :1;
      uint16_t U1TXIP0:1;
      uint16_t U1TXIP1:1;
      uint16_t U1TXIP2:1;
      uint16_t :1;
      uint16_t ADIP0:1;
      uint16_t ADIP1:1;
      uint16_t ADIP2:1;
    };
  };
} IPC2BITS;
extern volatile IPC2BITS IPC2bits __attribute__((__sfr__));

#define IPC3 IPC3
extern volatile uint16_t IPC3 __attribute__((__sfr__));
__extension__ typedef struct tagIPC3BITS {
  union {
    struct {
      uint16_t NVMIP:3;
      uint16_t :1;
      uint16_t SI2CIP:3;
      uint16_t :1;
      uint16_t MI2CIP:3;
    };
    struct {
      uint16_t NVMIP0:1;
      uint16_t NVMIP1:1;
      uint16_t NVMIP2:1;
      uint16_t :1;
      uint16_t SI2CIP0:1;
      uint16_t SI2CIP1:1;
      uint16_t SI2CIP2:1;
      uint16_t :1;
      uint16_t MI2CIP0:1;
      uint16_t MI2CIP1:1;
      uint16_t MI2CIP2:1;
    };
  };
} IPC3BITS;
extern volatile IPC3BITS IPC3bits __attribute__((__sfr__));

#define IPC4 IPC4
extern volatile uint16_t IPC4 __attribute__((__sfr__));
__extension__ typedef struct tagIPC4BITS {
  union {
    struct {
      uint16_t INT1IP:3;
      uint16_t :1;
      uint16_t INT2IP:3;
      uint16_t :1;
      uint16_t PSEMIP:3;
      uint16_t :1;
      uint16_t PWM1IP:3;
    };
    struct {
      uint16_t INT1IP0:1;
      uint16_t INT1IP1:1;
      uint16_t INT1IP2:1;
      uint16_t :1;
      uint16_t INT2IP0:1;
      uint16_t INT2IP1:1;
      uint16_t INT2IP2:1;
      uint16_t :1;
      uint16_t PSEMIP0:1;
      uint16_t PSEMIP1:1;
      uint16_t PSEMIP2:1;
      uint16_t :1;
      uint16_t PWM1IP0:1;
      uint16_t PWM1IP1:1;
      uint16_t PWM1IP2:1;
    };
  };
} IPC4BITS;
extern volatile IPC4BITS IPC4bits __attribute__((__sfr__));

#define IPC5 IPC5
extern volatile uint16_t IPC5 __attribute__((__sfr__));
__extension__ typedef struct tagIPC5BITS {
  union {
    struct {
      uint16_t PWM2IP:3;
      uint16_t :1;
      uint16_t PWM3IP:3;
      uint16_t :1;
      uint16_t PWM4IP:3;
    };
    struct {
      uint16_t PWM2IP0:1;
      uint16_t PWM2IP1:1;
      uint16_t PWM2IP2:1;
      uint16_t :1;
      uint16_t PWM3IP0:1;
      uint16_t PWM3IP1:1;
      uint16_t PWM3IP2:1;
      uint16_t :1;
      uint16_t PWM4IP0:1;
      uint16_t PWM4IP1:1;
      uint16_t PWM4IP2:1;
    };
  };
} IPC5BITS;
extern volatile IPC5BITS IPC5bits __attribute__((__sfr__));

#define IPC6 IPC6
extern volatile uint16_t IPC6 __attribute__((__sfr__));
__extension__ typedef struct tagIPC6BITS {
  union {
    struct {
      uint16_t :12;
      uint16_t CNIP:3;
    };
    struct {
      uint16_t :12;
      uint16_t CNIP0:1;
      uint16_t CNIP1:1;
      uint16_t CNIP2:1;
    };
  };
} IPC6BITS;
extern volatile IPC6BITS IPC6bits __attribute__((__sfr__));

#define IPC7 IPC7
extern volatile uint16_t IPC7 __attribute__((__sfr__));
__extension__ typedef struct tagIPC7BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t AC1IP:3;
      uint16_t :1;
      uint16_t AC2IP:3;
      uint16_t :1;
      uint16_t AC3IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t AC1IP0:1;
      uint16_t AC1IP1:1;
      uint16_t AC1IP2:1;
      uint16_t :1;
      uint16_t AC2IP0:1;
      uint16_t AC2IP1:1;
      uint16_t AC2IP2:1;
      uint16_t :1;
      uint16_t AC3IP0:1;
      uint16_t AC3IP1:1;
      uint16_t AC3IP2:1;
    };
  };
} IPC7BITS;
extern volatile IPC7BITS IPC7bits __attribute__((__sfr__));

#define IPC8 IPC8
extern volatile uint16_t IPC8 __attribute__((__sfr__));
__extension__ typedef struct tagIPC8BITS {
  union {
    struct {
      uint16_t AC4IP:3;
    };
    struct {
      uint16_t AC4IP0:1;
      uint16_t AC4IP1:1;
      uint16_t AC4IP2:1;
    };
  };
} IPC8BITS;
extern volatile IPC8BITS IPC8bits __attribute__((__sfr__));

#define IPC9 IPC9
extern volatile uint16_t IPC9 __attribute__((__sfr__));
__extension__ typedef struct tagIPC9BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t ADCP0IP:3;
      uint16_t :1;
      uint16_t ADCP1IP:3;
      uint16_t :1;
      uint16_t ADCP2IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t ADCP0IP0:1;
      uint16_t ADCP0IP1:1;
      uint16_t ADCP0IP2:1;
      uint16_t :1;
      uint16_t ADCP1IP0:1;
      uint16_t ADCP1IP1:1;
      uint16_t ADCP1IP2:1;
      uint16_t :1;
      uint16_t ADCP2IP0:1;
      uint16_t ADCP2IP1:1;
      uint16_t ADCP2IP2:1;
    };
  };
} IPC9BITS;
