MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
/* CMPDAC4 */
/* Bitname _CMREF0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF9 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF cannot be defined because it is used by more than one SFR */

/* RCON */
#define _POR RCONbits.POR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _TSEQEN OSCCONbits.TSEQEN
#define _CF OSCCONbits.CF
#define _PRCDEN OSCCONbits.PRCDEN
#define _LOCK OSCCONbits.LOCK
#define _CLKLOCK OSCCONbits.CLKLOCK
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* OSCTUN */
#define _TUN OSCTUNbits.TUN
#define _TSEQ1 OSCTUNbits.TSEQ1
#define _TSEQ2 OSCTUNbits.TSEQ2
#define _TSEQ3 OSCTUNbits.TSEQ3
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3
#define _TSEQ10 OSCTUNbits.TSEQ10
#define _TSEQ11 OSCTUNbits.TSEQ11
#define _TSEQ12 OSCTUNbits.TSEQ12
#define _TSEQ13 OSCTUNbits.TSEQ13
#define _TSEQ20 OSCTUNbits.TSEQ20
#define _TSEQ21 OSCTUNbits.TSEQ21
#define _TSEQ22 OSCTUNbits.TSEQ22
#define _TSEQ23 OSCTUNbits.TSEQ23
#define _TSEQ30 OSCTUNbits.TSEQ30
#define _TSEQ31 OSCTUNbits.TSEQ31
#define _TSEQ32 OSCTUNbits.TSEQ32
#define _TSEQ33 OSCTUNbits.TSEQ33

/* OSCTUN2 */
#define _TSEQ4 OSCTUN2bits.TSEQ4
#define _TSEQ5 OSCTUN2bits.TSEQ5
#define _TSEQ6 OSCTUN2bits.TSEQ6
#define _TSEQ7 OSCTUN2bits.TSEQ7
#define _TSEQ40 OSCTUN2bits.TSEQ40
#define _TSEQ41 OSCTUN2bits.TSEQ41
#define _TSEQ42 OSCTUN2bits.TSEQ42
#define _TSEQ43 OSCTUN2bits.TSEQ43
#define _TSEQ50 OSCTUN2bits.TSEQ50
#define _TSEQ51 OSCTUN2bits.TSEQ51
#define _TSEQ52 OSCTUN2bits.TSEQ52
#define _TSEQ53 OSCTUN2bits.TSEQ53
#define _TSEQ60 OSCTUN2bits.TSEQ60
#define _TSEQ61 OSCTUN2bits.TSEQ61
#define _TSEQ62 OSCTUN2bits.TSEQ62
#define _TSEQ63 OSCTUN2bits.TSEQ63
#define _TSEQ70 OSCTUN2bits.TSEQ70
#define _TSEQ71 OSCTUN2bits.TSEQ71
#define _TSEQ72 OSCTUN2bits.TSEQ72
#define _TSEQ73 OSCTUN2bits.TSEQ73

/* BSRAM */
#define _RL_BSR BSRAMbits.RL_BSR
#define _IR_BSR BSRAMbits.IR_BSR
#define _IW_BSR BSRAMbits.IW_BSR

/* NVMCON */
#define _PROGOP NVMCONbits.PROGOP
#define _TWRI NVMCONbits.TWRI
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _PROGOP0 NVMCONbits.PROGOP0
#define _PROGOP1 NVMCONbits.PROGOP1
#define _PROGOP2 NVMCONbits.PROGOP2
#define _PROGOP3 NVMCONbits.PROGOP3
#define _PROGOP4 NVMCONbits.PROGOP4
#define _PROGOP5 NVMCONbits.PROGOP5
#define _PROGOP6 NVMCONbits.PROGOP6

/* NVMADRU */
#define _NVMADR NVMADRUbits.NVMADR

/* NVMKEY */
#define _NVMKEY NVMKEYbits.NVMKEY

/* PMD1 */
#define _ADCMD PMD1bits.ADCMD
#define _SPI1MD PMD1bits.SPI1MD
#define _U1MD PMD1bits.U1MD
#define _I2CMD PMD1bits.I2CMD
#define _PWMMD PMD1bits.PWMMD
#define _T1MD PMD1bits.T1MD
#define _T2MD PMD1bits.T2MD
#define _T3MD PMD1bits.T3MD

/* PMD2 */
#define _OC1MD PMD2bits.OC1MD
#define _OC2MD PMD2bits.OC2MD
#define _IC1MD PMD2bits.IC1MD

/* PMD3 */
#define _CMP_PSMD PMD3bits.CMP_PSMD


/*----------------------------------------------------------- */
/* Some useful macros for allocating data memory              */
/*----------------------------------------------------------- */

/* The following macros require an argument N that specifies  */
/* alignment. N must a power of two, minimum value = 2.       */
/* For example, to declare an uninitialized array in X memory */
/* that is aligned to a 32 byte address:                      */
/*                                                            */
/* int _XBSS(32) xbuf[16];                                    */
/*                                                            */
#define _XBSS(N)    __attribute__((space(xmemory),aligned(N)))
#define _XDATA(N)   __attribute__((space(xmemory),aligned(N)))
#define _YBSS(N)    __attribute__((space(ymemory),aligned(N)))
#define _YDATA(N)   __attribute__((space(ymemory),aligned(N)))
/*                                                            */
/* To declare an initialized array in data EEPROM without     */
/* special alignment:                                         */
/*                                                            */
/* int _EEDATA(2) table1[] = {0, 1, 1, 2, 3, 5, 8, 13, 21};   */
/*                                                            */
#define _EEDATA(N)   __attribute__((space(eedata),aligned(N)))

/* The following macros do not require an argument. They can  */
/* be used to locate a variable in persistent data memory or  */
/* in near data memory. For example, to declare two variables */
/* that retain their values across a device reset:            */
/*                                                            */
/* int _PERSISTENT var1,var2;                                 */
/*                                                            */
#define _PERSISTENT __attribute__((persistent))
#define _NEAR       __attribute__((near))

/* ---------------------------------------------------------- */
/* Some useful macros for declaring functions                 */
/* ---------------------------------------------------------- */

/* The following macros can be used to declare interrupt      */
/* service routines (ISRs). For example, to declare an ISR    */
/* for the timer1 interrupt:                                  */
/*                                                            */
/* void _ISR _T1Interrupt(void);                              */
/*                                                            */
/* To declare an ISR for the SPI1 interrupt with fast         */
/* context save:                                              */
/*                                                            */
/* void _ISRFAST _SPI1Interrupt(void);                        */
/*                                                            */
/* Note: ISRs will be installed into the interrupt vector     */
/* tables automatically if the reserved names listed in the   */
/* MPLAB C30 Compiler User's Guide (DS51284) are used.        */
/*                                                            */
#define _ISR __attribute__((interrupt))
#define _ISRFAST __attribute__((interrupt, shadow))

/* ---------------------------------------------------------- */
/* Some useful macros for changing the CPU IPL                */
/* ---------------------------------------------------------- */

