MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define _IPC4_PWM1IP0_POSITION                   0x0000000C
#define _IPC4_PWM1IP0_MASK                       0x00001000
#define _IPC4_PWM1IP0_LENGTH                     0x00000001

#define _IPC4_PWM1IP1_POSITION                   0x0000000D
#define _IPC4_PWM1IP1_MASK                       0x00002000
#define _IPC4_PWM1IP1_LENGTH                     0x00000001

#define _IPC4_PWM1IP2_POSITION                   0x0000000E
#define _IPC4_PWM1IP2_MASK                       0x00004000
#define _IPC4_PWM1IP2_LENGTH                     0x00000001

#define _IPC5_PWM2IP_POSITION                    0x00000000
#define _IPC5_PWM2IP_MASK                        0x00000007
#define _IPC5_PWM2IP_LENGTH                      0x00000003

#define _IPC5_PWM3IP_POSITION                    0x00000004
#define _IPC5_PWM3IP_MASK                        0x00000070
#define _IPC5_PWM3IP_LENGTH                      0x00000003

#define _IPC5_PWM4IP_POSITION                    0x00000008
#define _IPC5_PWM4IP_MASK                        0x00000700
#define _IPC5_PWM4IP_LENGTH                      0x00000003

#define _IPC5_PWM2IP0_POSITION                   0x00000000
#define _IPC5_PWM2IP0_MASK                       0x00000001
#define _IPC5_PWM2IP0_LENGTH                     0x00000001

#define _IPC5_PWM2IP1_POSITION                   0x00000001
#define _IPC5_PWM2IP1_MASK                       0x00000002
#define _IPC5_PWM2IP1_LENGTH                     0x00000001

#define _IPC5_PWM2IP2_POSITION                   0x00000002
#define _IPC5_PWM2IP2_MASK                       0x00000004
#define _IPC5_PWM2IP2_LENGTH                     0x00000001

#define _IPC5_PWM3IP0_POSITION                   0x00000004
#define _IPC5_PWM3IP0_MASK                       0x00000010
#define _IPC5_PWM3IP0_LENGTH                     0x00000001

#define _IPC5_PWM3IP1_POSITION                   0x00000005
#define _IPC5_PWM3IP1_MASK                       0x00000020
#define _IPC5_PWM3IP1_LENGTH                     0x00000001

#define _IPC5_PWM3IP2_POSITION                   0x00000006
#define _IPC5_PWM3IP2_MASK                       0x00000040
#define _IPC5_PWM3IP2_LENGTH                     0x00000001

#define _IPC5_PWM4IP0_POSITION                   0x00000008
#define _IPC5_PWM4IP0_MASK                       0x00000100
#define _IPC5_PWM4IP0_LENGTH                     0x00000001

#define _IPC5_PWM4IP1_POSITION                   0x00000009
#define _IPC5_PWM4IP1_MASK                       0x00000200
#define _IPC5_PWM4IP1_LENGTH                     0x00000001

#define _IPC5_PWM4IP2_POSITION                   0x0000000A
#define _IPC5_PWM4IP2_MASK                       0x00000400
#define _IPC5_PWM4IP2_LENGTH                     0x00000001

#define _IPC6_CNIP_POSITION                      0x0000000C
#define _IPC6_CNIP_MASK                          0x00007000
#define _IPC6_CNIP_LENGTH                        0x00000003

#define _IPC6_CNIP0_POSITION                     0x0000000C
#define _IPC6_CNIP0_MASK                         0x00001000
#define _IPC6_CNIP0_LENGTH                       0x00000001

#define _IPC6_CNIP1_POSITION                     0x0000000D
#define _IPC6_CNIP1_MASK                         0x00002000
#define _IPC6_CNIP1_LENGTH                       0x00000001

#define _IPC6_CNIP2_POSITION                     0x0000000E
#define _IPC6_CNIP2_MASK                         0x00004000
#define _IPC6_CNIP2_LENGTH                       0x00000001

#define _IPC7_AC1IP_POSITION                     0x00000004
#define _IPC7_AC1IP_MASK                         0x00000070
#define _IPC7_AC1IP_LENGTH                       0x00000003

#define _IPC7_AC2IP_POSITION                     0x00000008
#define _IPC7_AC2IP_MASK                         0x00000700
#define _IPC7_AC2IP_LENGTH                       0x00000003

#define _IPC7_AC3IP_POSITION                     0x0000000C
#define _IPC7_AC3IP_MASK                         0x00007000
#define _IPC7_AC3IP_LENGTH                       0x00000003

#define _IPC7_AC1IP0_POSITION                    0x00000004
#define _IPC7_AC1IP0_MASK                        0x00000010
#define _IPC7_AC1IP0_LENGTH                      0x00000001

#define _IPC7_AC1IP1_POSITION                    0x00000005
#define _IPC7_AC1IP1_MASK                        0x00000020
#define _IPC7_AC1IP1_LENGTH                      0x00000001

#define _IPC7_AC1IP2_POSITION                    0x00000006
#define _IPC7_AC1IP2_MASK                        0x00000040
#define _IPC7_AC1IP2_LENGTH                      0x00000001

#define _IPC7_AC2IP0_POSITION                    0x00000008
#define _IPC7_AC2IP0_MASK                        0x00000100
#define _IPC7_AC2IP0_LENGTH                      0x00000001

#define _IPC7_AC2IP1_POSITION                    0x00000009
#define _IPC7_AC2IP1_MASK                        0x00000200
#define _IPC7_AC2IP1_LENGTH                      0x00000001

#define _IPC7_AC2IP2_POSITION                    0x0000000A
#define _IPC7_AC2IP2_MASK                        0x00000400
#define _IPC7_AC2IP2_LENGTH                      0x00000001

#define _IPC7_AC3IP0_POSITION                    0x0000000C
#define _IPC7_AC3IP0_MASK                        0x00001000
#define _IPC7_AC3IP0_LENGTH                      0x00000001

#define _IPC7_AC3IP1_POSITION                    0x0000000D
#define _IPC7_AC3IP1_MASK                        0x00002000
#define _IPC7_AC3IP1_LENGTH                      0x00000001

#define _IPC7_AC3IP2_POSITION                    0x0000000E
#define _IPC7_AC3IP2_MASK                        0x00004000
#define _IPC7_AC3IP2_LENGTH                      0x00000001

#define _IPC8_AC4IP_POSITION                     0x00000000
#define _IPC8_AC4IP_MASK                         0x00000007
#define _IPC8_AC4IP_LENGTH                       0x00000003

#define _IPC8_AC4IP0_POSITION                    0x00000000
#define _IPC8_AC4IP0_MASK                        0x00000001
#define _IPC8_AC4IP0_LENGTH                      0x00000001

#define _IPC8_AC4IP1_POSITION                    0x00000001
#define _IPC8_AC4IP1_MASK                        0x00000002
#define _IPC8_AC4IP1_LENGTH                      0x00000001

#define _IPC8_AC4IP2_POSITION                    0x00000002
#define _IPC8_AC4IP2_MASK                        0x00000004
#define _IPC8_AC4IP2_LENGTH                      0x00000001

#define _IPC9_ADCP0IP_POSITION                   0x00000004
#define _IPC9_ADCP0IP_MASK                       0x00000070
#define _IPC9_ADCP0IP_LENGTH                     0x00000003

