MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define _IPC9_ADCP1IP_POSITION                   0x00000008
#define _IPC9_ADCP1IP_MASK                       0x00000700
#define _IPC9_ADCP1IP_LENGTH                     0x00000003

#define _IPC9_ADCP2IP_POSITION                   0x0000000C
#define _IPC9_ADCP2IP_MASK                       0x00007000
#define _IPC9_ADCP2IP_LENGTH                     0x00000003

#define _IPC9_ADCP0IP0_POSITION                  0x00000004
#define _IPC9_ADCP0IP0_MASK                      0x00000010
#define _IPC9_ADCP0IP0_LENGTH                    0x00000001

#define _IPC9_ADCP0IP1_POSITION                  0x00000005
#define _IPC9_ADCP0IP1_MASK                      0x00000020
#define _IPC9_ADCP0IP1_LENGTH                    0x00000001

#define _IPC9_ADCP0IP2_POSITION                  0x00000006
#define _IPC9_ADCP0IP2_MASK                      0x00000040
#define _IPC9_ADCP0IP2_LENGTH                    0x00000001

#define _IPC9_ADCP1IP0_POSITION                  0x00000008
#define _IPC9_ADCP1IP0_MASK                      0x00000100
#define _IPC9_ADCP1IP0_LENGTH                    0x00000001

#define _IPC9_ADCP1IP1_POSITION                  0x00000009
#define _IPC9_ADCP1IP1_MASK                      0x00000200
#define _IPC9_ADCP1IP1_LENGTH                    0x00000001

#define _IPC9_ADCP1IP2_POSITION                  0x0000000A
#define _IPC9_ADCP1IP2_MASK                      0x00000400
#define _IPC9_ADCP1IP2_LENGTH                    0x00000001

#define _IPC9_ADCP2IP0_POSITION                  0x0000000C
#define _IPC9_ADCP2IP0_MASK                      0x00001000
#define _IPC9_ADCP2IP0_LENGTH                    0x00000001

#define _IPC9_ADCP2IP1_POSITION                  0x0000000D
#define _IPC9_ADCP2IP1_MASK                      0x00002000
#define _IPC9_ADCP2IP1_LENGTH                    0x00000001

#define _IPC9_ADCP2IP2_POSITION                  0x0000000E
#define _IPC9_ADCP2IP2_MASK                      0x00004000
#define _IPC9_ADCP2IP2_LENGTH                    0x00000001

#define _IPC10_ADCP3IP_POSITION                  0x00000000
#define _IPC10_ADCP3IP_MASK                      0x00000007
#define _IPC10_ADCP3IP_LENGTH                    0x00000003

#define _IPC10_ADCP4IP_POSITION                  0x00000004
#define _IPC10_ADCP4IP_MASK                      0x00000070
#define _IPC10_ADCP4IP_LENGTH                    0x00000003

#define _IPC10_ADCP5IP_POSITION                  0x00000008
#define _IPC10_ADCP5IP_MASK                      0x00000700
#define _IPC10_ADCP5IP_LENGTH                    0x00000003

#define _IPC10_ADCP3IP0_POSITION                 0x00000000
#define _IPC10_ADCP3IP0_MASK                     0x00000001
#define _IPC10_ADCP3IP0_LENGTH                   0x00000001

#define _IPC10_ADCP3IP1_POSITION                 0x00000001
#define _IPC10_ADCP3IP1_MASK                     0x00000002
#define _IPC10_ADCP3IP1_LENGTH                   0x00000001

#define _IPC10_ADCP3IP2_POSITION                 0x00000002
#define _IPC10_ADCP3IP2_MASK                     0x00000004
#define _IPC10_ADCP3IP2_LENGTH                   0x00000001

#define _IPC10_ADCP4IP0_POSITION                 0x00000004
#define _IPC10_ADCP4IP0_MASK                     0x00000010
#define _IPC10_ADCP4IP0_LENGTH                   0x00000001

#define _IPC10_ADCP4IP1_POSITION                 0x00000005
#define _IPC10_ADCP4IP1_MASK                     0x00000020
#define _IPC10_ADCP4IP1_LENGTH                   0x00000001

#define _IPC10_ADCP4IP2_POSITION                 0x00000006
#define _IPC10_ADCP4IP2_MASK                     0x00000040
#define _IPC10_ADCP4IP2_LENGTH                   0x00000001

#define _IPC10_ADCP5IP0_POSITION                 0x00000008
#define _IPC10_ADCP5IP0_MASK                     0x00000100
#define _IPC10_ADCP5IP0_LENGTH                   0x00000001

#define _IPC10_ADCP5IP1_POSITION                 0x00000009
#define _IPC10_ADCP5IP1_MASK                     0x00000200
#define _IPC10_ADCP5IP1_LENGTH                   0x00000001

#define _IPC10_ADCP5IP2_POSITION                 0x0000000A
#define _IPC10_ADCP5IP2_MASK                     0x00000400
#define _IPC10_ADCP5IP2_LENGTH                   0x00000001

#define _INTTREG_VECNUM_POSITION                 0x00000000
#define _INTTREG_VECNUM_MASK                     0x0000007F
#define _INTTREG_VECNUM_LENGTH                   0x00000007

#define _INTTREG_ILR_POSITION                    0x00000008
#define _INTTREG_ILR_MASK                        0x00000F00
#define _INTTREG_ILR_LENGTH                      0x00000004

#define _INTTREG_VECNUM0_POSITION                0x00000000
#define _INTTREG_VECNUM0_MASK                    0x00000001
#define _INTTREG_VECNUM0_LENGTH                  0x00000001

#define _INTTREG_VECNUM1_POSITION                0x00000001
#define _INTTREG_VECNUM1_MASK                    0x00000002
#define _INTTREG_VECNUM1_LENGTH                  0x00000001

#define _INTTREG_VECNUM2_POSITION                0x00000002
#define _INTTREG_VECNUM2_MASK                    0x00000004
#define _INTTREG_VECNUM2_LENGTH                  0x00000001

#define _INTTREG_VECNUM3_POSITION                0x00000003
#define _INTTREG_VECNUM3_MASK                    0x00000008
#define _INTTREG_VECNUM3_LENGTH                  0x00000001

#define _INTTREG_VECNUM4_POSITION                0x00000004
#define _INTTREG_VECNUM4_MASK                    0x00000010
#define _INTTREG_VECNUM4_LENGTH                  0x00000001

#define _INTTREG_VECNUM5_POSITION                0x00000005
#define _INTTREG_VECNUM5_MASK                    0x00000020
#define _INTTREG_VECNUM5_LENGTH                  0x00000001

#define _INTTREG_VECNUM6_POSITION                0x00000006
#define _INTTREG_VECNUM6_MASK                    0x00000040
#define _INTTREG_VECNUM6_LENGTH                  0x00000001

#define _INTTREG_ILR0_POSITION                   0x00000008
#define _INTTREG_ILR0_MASK                       0x00000100
#define _INTTREG_ILR0_LENGTH                     0x00000001

#define _INTTREG_ILR1_POSITION                   0x00000009
#define _INTTREG_ILR1_MASK                       0x00000200
#define _INTTREG_ILR1_LENGTH                     0x00000001

#define _INTTREG_ILR2_POSITION                   0x0000000A
#define _INTTREG_ILR2_MASK                       0x00000400
#define _INTTREG_ILR2_LENGTH                     0x00000001

#define _INTTREG_ILR3_POSITION                   0x0000000B
#define _INTTREG_ILR3_MASK                       0x00000800
#define _INTTREG_ILR3_LENGTH                     0x00000001

