MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define _PORTF_RF14_POSITION                     0x0000000E
#define _PORTF_RF14_MASK                         0x00004000
#define _PORTF_RF14_LENGTH                       0x00000001

#define _PORTF_RF15_POSITION                     0x0000000F
#define _PORTF_RF15_MASK                         0x00008000
#define _PORTF_RF15_LENGTH                       0x00000001

#define _LATF_LATF2_POSITION                     0x00000002
#define _LATF_LATF2_MASK                         0x00000004
#define _LATF_LATF2_LENGTH                       0x00000001

#define _LATF_LATF3_POSITION                     0x00000003
#define _LATF_LATF3_MASK                         0x00000008
#define _LATF_LATF3_LENGTH                       0x00000001

#define _LATF_LATF6_POSITION                     0x00000006
#define _LATF_LATF6_MASK                         0x00000040
#define _LATF_LATF6_LENGTH                       0x00000001

#define _LATF_LATF7_POSITION                     0x00000007
#define _LATF_LATF7_MASK                         0x00000080
#define _LATF_LATF7_LENGTH                       0x00000001

#define _LATF_LATF8_POSITION                     0x00000008
#define _LATF_LATF8_MASK                         0x00000100
#define _LATF_LATF8_LENGTH                       0x00000001

#define _LATF_LATF14_POSITION                    0x0000000E
#define _LATF_LATF14_MASK                        0x00004000
#define _LATF_LATF14_LENGTH                      0x00000001

#define _LATF_LATF15_POSITION                    0x0000000F
#define _LATF_LATF15_MASK                        0x00008000
#define _LATF_LATF15_LENGTH                      0x00000001

#define _TRISG_TRISG2_POSITION                   0x00000002
#define _TRISG_TRISG2_MASK                       0x00000004
#define _TRISG_TRISG2_LENGTH                     0x00000001

#define _TRISG_TRISG3_POSITION                   0x00000003
#define _TRISG_TRISG3_MASK                       0x00000008
#define _TRISG_TRISG3_LENGTH                     0x00000001

#define _PORTG_RG2_POSITION                      0x00000002
#define _PORTG_RG2_MASK                          0x00000004
#define _PORTG_RG2_LENGTH                        0x00000001

#define _PORTG_RG3_POSITION                      0x00000003
#define _PORTG_RG3_MASK                          0x00000008
#define _PORTG_RG3_LENGTH                        0x00000001

#define _LATG_LATG2_POSITION                     0x00000002
#define _LATG_LATG2_MASK                         0x00000004
#define _LATG_LATG2_LENGTH                       0x00000001

#define _LATG_LATG3_POSITION                     0x00000003
#define _LATG_LATG3_MASK                         0x00000008
#define _LATG_LATG3_LENGTH                       0x00000001

#define _ADCON_ADCS_POSITION                     0x00000000
#define _ADCON_ADCS_MASK                         0x00000007
#define _ADCON_ADCS_LENGTH                       0x00000003

#define _ADCON_SEQSAMP_POSITION                  0x00000005
#define _ADCON_SEQSAMP_MASK                      0x00000020
#define _ADCON_SEQSAMP_LENGTH                    0x00000001

#define _ADCON_ORDER_POSITION                    0x00000006
#define _ADCON_ORDER_MASK                        0x00000040
#define _ADCON_ORDER_LENGTH                      0x00000001

#define _ADCON_EIE_POSITION                      0x00000007
#define _ADCON_EIE_MASK                          0x00000080
#define _ADCON_EIE_LENGTH                        0x00000001

#define _ADCON_FORM_POSITION                     0x00000008
#define _ADCON_FORM_MASK                         0x00000100
#define _ADCON_FORM_LENGTH                       0x00000001

#define _ADCON_GSWTRG_POSITION                   0x0000000A
#define _ADCON_GSWTRG_MASK                       0x00000400
#define _ADCON_GSWTRG_LENGTH                     0x00000001

#define _ADCON_ADSIDL_POSITION                   0x0000000D
#define _ADCON_ADSIDL_MASK                       0x00002000
#define _ADCON_ADSIDL_LENGTH                     0x00000001

#define _ADCON_ADON_POSITION                     0x0000000F
#define _ADCON_ADON_MASK                         0x00008000
#define _ADCON_ADON_LENGTH                       0x00000001

#define _ADCON_ADCS0_POSITION                    0x00000000
#define _ADCON_ADCS0_MASK                        0x00000001
#define _ADCON_ADCS0_LENGTH                      0x00000001

#define _ADCON_ADCS1_POSITION                    0x00000001
#define _ADCON_ADCS1_MASK                        0x00000002
#define _ADCON_ADCS1_LENGTH                      0x00000001

#define _ADCON_ADCS2_POSITION                    0x00000002
#define _ADCON_ADCS2_MASK                        0x00000004
#define _ADCON_ADCS2_LENGTH                      0x00000001

#define _ADPCFG_PCFG0_POSITION                   0x00000000
#define _ADPCFG_PCFG0_MASK                       0x00000001
#define _ADPCFG_PCFG0_LENGTH                     0x00000001

#define _ADPCFG_PCFG1_POSITION                   0x00000001
#define _ADPCFG_PCFG1_MASK                       0x00000002
#define _ADPCFG_PCFG1_LENGTH                     0x00000001

#define _ADPCFG_PCFG2_POSITION                   0x00000002
#define _ADPCFG_PCFG2_MASK                       0x00000004
#define _ADPCFG_PCFG2_LENGTH                     0x00000001

#define _ADPCFG_PCFG3_POSITION                   0x00000003
#define _ADPCFG_PCFG3_MASK                       0x00000008
#define _ADPCFG_PCFG3_LENGTH                     0x00000001

#define _ADPCFG_PCFG4_POSITION                   0x00000004
#define _ADPCFG_PCFG4_MASK                       0x00000010
#define _ADPCFG_PCFG4_LENGTH                     0x00000001

#define _ADPCFG_PCFG5_POSITION                   0x00000005
#define _ADPCFG_PCFG5_MASK                       0x00000020
#define _ADPCFG_PCFG5_LENGTH                     0x00000001

#define _ADPCFG_PCFG6_POSITION                   0x00000006
#define _ADPCFG_PCFG6_MASK                       0x00000040
#define _ADPCFG_PCFG6_LENGTH                     0x00000001

#define _ADPCFG_PCFG7_POSITION                   0x00000007
#define _ADPCFG_PCFG7_MASK                       0x00000080
#define _ADPCFG_PCFG7_LENGTH                     0x00000001

#define _ADPCFG_PCFG8_POSITION                   0x00000008
#define _ADPCFG_PCFG8_MASK                       0x00000100
#define _ADPCFG_PCFG8_LENGTH                     0x00000001

#define _ADPCFG_PCFG9_POSITION                   0x00000009
#define _ADPCFG_PCFG9_MASK                       0x00000200
#define _ADPCFG_PCFG9_LENGTH                     0x00000001

#define _ADPCFG_PCFG10_POSITION                  0x0000000A
#define _ADPCFG_PCFG10_MASK                      0x00000400
#define _ADPCFG_PCFG10_LENGTH                    0x00000001

#define _ADPCFG_PCFG11_POSITION                  0x0000000B
#define _ADPCFG_PCFG11_MASK                      0x00000800
#define _ADPCFG_PCFG11_LENGTH                    0x00000001

#define _ADSTAT_P0RDY_POSITION                   0x00000000
#define _ADSTAT_P0RDY_MASK                       0x00000001
#define _ADSTAT_P0RDY_LENGTH                     0x00000001

#define _ADSTAT_P1RDY_POSITION                   0x00000001
#define _ADSTAT_P1RDY_MASK                       0x00000002
#define _ADSTAT_P1RDY_LENGTH                     0x00000001

