MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define _ADCPC1_TRGSRC24_POSITION                0x00000004
#define _ADCPC1_TRGSRC24_MASK                    0x00000010
#define _ADCPC1_TRGSRC24_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC30_POSITION                0x00000008
#define _ADCPC1_TRGSRC30_MASK                    0x00000100
#define _ADCPC1_TRGSRC30_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC31_POSITION                0x00000009
#define _ADCPC1_TRGSRC31_MASK                    0x00000200
#define _ADCPC1_TRGSRC31_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC32_POSITION                0x0000000A
#define _ADCPC1_TRGSRC32_MASK                    0x00000400
#define _ADCPC1_TRGSRC32_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC33_POSITION                0x0000000B
#define _ADCPC1_TRGSRC33_MASK                    0x00000800
#define _ADCPC1_TRGSRC33_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC34_POSITION                0x0000000C
#define _ADCPC1_TRGSRC34_MASK                    0x00001000
#define _ADCPC1_TRGSRC34_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC4_POSITION                 0x00000000
#define _ADCPC2_TRGSRC4_MASK                     0x0000001F
#define _ADCPC2_TRGSRC4_LENGTH                   0x00000005

#define _ADCPC2_SWTRG4_POSITION                  0x00000005
#define _ADCPC2_SWTRG4_MASK                      0x00000020
#define _ADCPC2_SWTRG4_LENGTH                    0x00000001

#define _ADCPC2_PEND4_POSITION                   0x00000006
#define _ADCPC2_PEND4_MASK                       0x00000040
#define _ADCPC2_PEND4_LENGTH                     0x00000001

#define _ADCPC2_IRQEN4_POSITION                  0x00000007
#define _ADCPC2_IRQEN4_MASK                      0x00000080
#define _ADCPC2_IRQEN4_LENGTH                    0x00000001

#define _ADCPC2_TRGSRC5_POSITION                 0x00000008
#define _ADCPC2_TRGSRC5_MASK                     0x00001F00
#define _ADCPC2_TRGSRC5_LENGTH                   0x00000005

#define _ADCPC2_SWTRG5_POSITION                  0x0000000D
#define _ADCPC2_SWTRG5_MASK                      0x00002000
#define _ADCPC2_SWTRG5_LENGTH                    0x00000001

#define _ADCPC2_PEND5_POSITION                   0x0000000E
#define _ADCPC2_PEND5_MASK                       0x00004000
#define _ADCPC2_PEND5_LENGTH                     0x00000001

#define _ADCPC2_IRQEN5_POSITION                  0x0000000F
#define _ADCPC2_IRQEN5_MASK                      0x00008000
#define _ADCPC2_IRQEN5_LENGTH                    0x00000001

#define _ADCPC2_TRGSRC40_POSITION                0x00000000
#define _ADCPC2_TRGSRC40_MASK                    0x00000001
#define _ADCPC2_TRGSRC40_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC41_POSITION                0x00000001
#define _ADCPC2_TRGSRC41_MASK                    0x00000002
#define _ADCPC2_TRGSRC41_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC42_POSITION                0x00000002
#define _ADCPC2_TRGSRC42_MASK                    0x00000004
#define _ADCPC2_TRGSRC42_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC43_POSITION                0x00000003
#define _ADCPC2_TRGSRC43_MASK                    0x00000008
#define _ADCPC2_TRGSRC43_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC44_POSITION                0x00000004
#define _ADCPC2_TRGSRC44_MASK                    0x00000010
#define _ADCPC2_TRGSRC44_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC50_POSITION                0x00000008
#define _ADCPC2_TRGSRC50_MASK                    0x00000100
#define _ADCPC2_TRGSRC50_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC51_POSITION                0x00000009
#define _ADCPC2_TRGSRC51_MASK                    0x00000200
#define _ADCPC2_TRGSRC51_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC52_POSITION                0x0000000A
#define _ADCPC2_TRGSRC52_MASK                    0x00000400
#define _ADCPC2_TRGSRC52_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC53_POSITION                0x0000000B
#define _ADCPC2_TRGSRC53_MASK                    0x00000800
#define _ADCPC2_TRGSRC53_LENGTH                  0x00000001

#define _ADCPC2_TRGSRC54_POSITION                0x0000000C
#define _ADCPC2_TRGSRC54_MASK                    0x00001000
#define _ADCPC2_TRGSRC54_LENGTH                  0x00000001

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000070
#define _PTCON_SYNCSRC_LENGTH                    0x00000003

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_SEVTPS0_POSITION                  0x00000000
#define _PTCON_SEVTPS0_MASK                      0x00000001
#define _PTCON_SEVTPS0_LENGTH                    0x00000001

#define _PTCON_SEVTPS1_POSITION                  0x00000001
#define _PTCON_SEVTPS1_MASK                      0x00000002
#define _PTCON_SEVTPS1_LENGTH                    0x00000001

#define _PTCON_SEVTPS2_POSITION                  0x00000002
#define _PTCON_SEVTPS2_MASK                      0x00000004
#define _PTCON_SEVTPS2_LENGTH                    0x00000001

#define _PTCON_SEVTPS3_POSITION                  0x00000003
#define _PTCON_SEVTPS3_MASK                      0x00000008
#define _PTCON_SEVTPS3_LENGTH                    0x00000001

