MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
#define _CMPCON2_CMPSIDL_POSITION                0x0000000D
#define _CMPCON2_CMPSIDL_MASK                    0x00002000
#define _CMPCON2_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON2_CMPON_POSITION                  0x0000000F
#define _CMPCON2_CMPON_MASK                      0x00008000
#define _CMPCON2_CMPON_LENGTH                    0x00000001

#define _CMPCON2_INSEL0_POSITION                 0x00000006
#define _CMPCON2_INSEL0_MASK                     0x00000040
#define _CMPCON2_INSEL0_LENGTH                   0x00000001

#define _CMPCON2_INSEL1_POSITION                 0x00000007
#define _CMPCON2_INSEL1_MASK                     0x00000080
#define _CMPCON2_INSEL1_LENGTH                   0x00000001

#define _CMPDAC2_CMREF0_POSITION                 0x00000000
#define _CMPDAC2_CMREF0_MASK                     0x00000001
#define _CMPDAC2_CMREF0_LENGTH                   0x00000001

#define _CMPDAC2_CMREF1_POSITION                 0x00000001
#define _CMPDAC2_CMREF1_MASK                     0x00000002
#define _CMPDAC2_CMREF1_LENGTH                   0x00000001

#define _CMPDAC2_CMREF2_POSITION                 0x00000002
#define _CMPDAC2_CMREF2_MASK                     0x00000004
#define _CMPDAC2_CMREF2_LENGTH                   0x00000001

#define _CMPDAC2_CMREF3_POSITION                 0x00000003
#define _CMPDAC2_CMREF3_MASK                     0x00000008
#define _CMPDAC2_CMREF3_LENGTH                   0x00000001

#define _CMPDAC2_CMREF4_POSITION                 0x00000004
#define _CMPDAC2_CMREF4_MASK                     0x00000010
#define _CMPDAC2_CMREF4_LENGTH                   0x00000001

#define _CMPDAC2_CMREF5_POSITION                 0x00000005
#define _CMPDAC2_CMREF5_MASK                     0x00000020
#define _CMPDAC2_CMREF5_LENGTH                   0x00000001

#define _CMPDAC2_CMREF6_POSITION                 0x00000006
#define _CMPDAC2_CMREF6_MASK                     0x00000040
#define _CMPDAC2_CMREF6_LENGTH                   0x00000001

#define _CMPDAC2_CMREF7_POSITION                 0x00000007
#define _CMPDAC2_CMREF7_MASK                     0x00000080
#define _CMPDAC2_CMREF7_LENGTH                   0x00000001

#define _CMPDAC2_CMREF8_POSITION                 0x00000008
#define _CMPDAC2_CMREF8_MASK                     0x00000100
#define _CMPDAC2_CMREF8_LENGTH                   0x00000001

#define _CMPDAC2_CMREF9_POSITION                 0x00000009
#define _CMPDAC2_CMREF9_MASK                     0x00000200
#define _CMPDAC2_CMREF9_LENGTH                   0x00000001

#define _CMPDAC2_CMREF_POSITION                  0x00000000
#define _CMPDAC2_CMREF_MASK                      0x000003FF
#define _CMPDAC2_CMREF_LENGTH                    0x0000000A

#define _CMPCON3_RANGE_POSITION                  0x00000000
#define _CMPCON3_RANGE_MASK                      0x00000001
#define _CMPCON3_RANGE_LENGTH                    0x00000001

#define _CMPCON3_CMPPOL_POSITION                 0x00000001
#define _CMPCON3_CMPPOL_MASK                     0x00000002
#define _CMPCON3_CMPPOL_LENGTH                   0x00000001

#define _CMPCON3_CMPSTAT_POSITION                0x00000003
#define _CMPCON3_CMPSTAT_MASK                    0x00000008
#define _CMPCON3_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON3_EXTREF_POSITION                 0x00000005
#define _CMPCON3_EXTREF_MASK                     0x00000020
#define _CMPCON3_EXTREF_LENGTH                   0x00000001

#define _CMPCON3_INSEL_POSITION                  0x00000006
#define _CMPCON3_INSEL_MASK                      0x000000C0
#define _CMPCON3_INSEL_LENGTH                    0x00000002

#define _CMPCON3_CMPSIDL_POSITION                0x0000000D
#define _CMPCON3_CMPSIDL_MASK                    0x00002000
#define _CMPCON3_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON3_CMPON_POSITION                  0x0000000F
#define _CMPCON3_CMPON_MASK                      0x00008000
#define _CMPCON3_CMPON_LENGTH                    0x00000001

#define _CMPCON3_INSEL0_POSITION                 0x00000006
#define _CMPCON3_INSEL0_MASK                     0x00000040
#define _CMPCON3_INSEL0_LENGTH                   0x00000001

#define _CMPCON3_INSEL1_POSITION                 0x00000007
#define _CMPCON3_INSEL1_MASK                     0x00000080
#define _CMPCON3_INSEL1_LENGTH                   0x00000001

#define _CMPDAC3_CMREF0_POSITION                 0x00000000
#define _CMPDAC3_CMREF0_MASK                     0x00000001
#define _CMPDAC3_CMREF0_LENGTH                   0x00000001

#define _CMPDAC3_CMREF1_POSITION                 0x00000001
#define _CMPDAC3_CMREF1_MASK                     0x00000002
#define _CMPDAC3_CMREF1_LENGTH                   0x00000001

#define _CMPDAC3_CMREF2_POSITION                 0x00000002
#define _CMPDAC3_CMREF2_MASK                     0x00000004
#define _CMPDAC3_CMREF2_LENGTH                   0x00000001

#define _CMPDAC3_CMREF3_POSITION                 0x00000003
#define _CMPDAC3_CMREF3_MASK                     0x00000008
#define _CMPDAC3_CMREF3_LENGTH                   0x00000001

#define _CMPDAC3_CMREF4_POSITION                 0x00000004
#define _CMPDAC3_CMREF4_MASK                     0x00000010
#define _CMPDAC3_CMREF4_LENGTH                   0x00000001

#define _CMPDAC3_CMREF5_POSITION                 0x00000005
#define _CMPDAC3_CMREF5_MASK                     0x00000020
#define _CMPDAC3_CMREF5_LENGTH                   0x00000001

#define _CMPDAC3_CMREF6_POSITION                 0x00000006
#define _CMPDAC3_CMREF6_MASK                     0x00000040
#define _CMPDAC3_CMREF6_LENGTH                   0x00000001

#define _CMPDAC3_CMREF7_POSITION                 0x00000007
#define _CMPDAC3_CMREF7_MASK                     0x00000080
#define _CMPDAC3_CMREF7_LENGTH                   0x00000001

#define _CMPDAC3_CMREF8_POSITION                 0x00000008
#define _CMPDAC3_CMREF8_MASK                     0x00000100
#define _CMPDAC3_CMREF8_LENGTH                   0x00000001

#define _CMPDAC3_CMREF9_POSITION                 0x00000009
#define _CMPDAC3_CMREF9_MASK                     0x00000200
#define _CMPDAC3_CMREF9_LENGTH                   0x00000001

#define _CMPDAC3_CMREF_POSITION                  0x00000000
#define _CMPDAC3_CMREF_MASK                      0x000003FF
#define _CMPDAC3_CMREF_LENGTH                    0x0000000A

#define _CMPCON4_RANGE_POSITION                  0x00000000
#define _CMPCON4_RANGE_MASK                      0x00000001
#define _CMPCON4_RANGE_LENGTH                    0x00000001

#define _CMPCON4_CMPPOL_POSITION                 0x00000001
#define _CMPCON4_CMPPOL_MASK                     0x00000002
#define _CMPCON4_CMPPOL_LENGTH                   0x00000001

#define _CMPCON4_CMPSTAT_POSITION                0x00000003
#define _CMPCON4_CMPSTAT_MASK                    0x00000008
#define _CMPCON4_CMPSTAT_LENGTH                  0x00000001

