MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F2023/mcu.h
/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FBS (0xf80000)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBS;
#define _FBS(x) __attribute__((address(0xf80000),deprecated_definition("consider migrating to #pragma config"),section("__FBS.sec"),space(prog))) __prog__ uint16_t _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write Protect:
**     BWRP_ON              Boot Segment is write protected
**     WR_PROT_BOOT_ON      Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**     WR_PROT_BOOT_OFF     Boot Segment may be written
**
**   Boot Segment Program Flash Code Protection:
**     HIGH_MEDIUM_BOOT_CODEHigh Security, Medium-sized Boot Flash
**     HIGH_SMALL_BOOT_CODE High Security, Small-sized Boot Flash
**     STRD_MEDIUM_BOOT_CODEStandard Security, Medium-sized Boot Flash
**     STRD_SMALL_BOOT_CODE Standard Security, Small-sized Boot Flash
**     NO_BOOT_CODE         No Boot Segment
**
*/

#define BWRP_ON              0x000E
#define WR_PROT_BOOT_ON      0x000E
#define BWRP_OFF             0x000F
#define WR_PROT_BOOT_OFF     0x000F

#define HIGH_MEDIUM_BOOT_CODE 0x0003
#define HIGH_SMALL_BOOT_CODE 0x0005
#define STRD_MEDIUM_BOOT_CODE 0x000B
#define STRD_SMALL_BOOT_CODE 0x000D
#define NO_BOOT_CODE         0x000F

/* Register FGS (0xf80004)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xf80004),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Code Segment Write Protect:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code Protection:
**     GSS_HIGH             High Security Code Protection Enabled
**     GSS_ON               Enabled
**     GSS_STD              Enabled
**     CODE_PROT_ON         Enabled
**     GSS_OFF              Disabled
**     CODE_PROT_OFF        Disabled
**
*/

#define GWRP_ON              0x0006
#define GWRP_OFF             0x0007

#define GSS_HIGH             0x0003
#define GSS_ON               0x0005
#define GSS_STD              0x0005
#define CODE_PROT_ON         0x0005
#define GSS_OFF              0x0007
#define CODE_PROT_OFF        0x0007

/* Register FOSCSEL (0xf80006)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0xf80006),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Mode:
**     FRC                  Internal Fast RC (FRC)
**     FRC_PLL              Internal Fast RC (FRC) w/ PLL
**     PRIOSC               Primary Oscillator (HS, EC)
**     PRIOSC_PLL           Primary Oscillator (HS, EC) w/ PLL
**
*/

#define FRC                  0x0000
#define FRC_PLL              0x0001
#define PRIOSC               0x0002
#define PRIOSC_PLL           0x0003

/* Register FOSC (0xf80008)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSC;
#define _FOSC(x) __attribute__((address(0xf80008),deprecated_definition("consider migrating to #pragma config"),section("__FOSC.sec"),space(prog))) __prog__ uint16_t _FOSC = (x);

/*
** Only one invocation of FOSC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSC.
** Multiple options may be combined, as shown:
**
** _FOSC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Primary Oscillator Source:
**     EC                   EC Oscillator Mode
**     HS                   HS Oscillator Mode
**     PRIOSC_OFF           Primary Oscillator Disabled
**     HS_EC_DIS            Primary Oscillator Disabled
**
**   OSCI/OSCO Pin Function:
**     OSC2_IO              OSCO pin has digital I/O function
**     OSC2_CLKO            OSCO pin has clock out function
**
**   Frequency Range Select:
**     FRC_LO_RANGE         Low Range
**     FRC_HI_RANGE         High Range
**
**   Clock Switching and Monitor:
**     CSW_FSCM_ON          Sw Enabled, Mon Enabled
**     CSW_ON_FSCM_OFF      Sw Enabled, Mon Disabled
**     CSW_FSCM_OFF         Sw Disabled, Mon Disabled
**
*/

#define EC                   0x00E4
#define HS                   0x00E6
#define PRIOSC_OFF           0x00E7
#define HS_EC_DIS            0x00E7

#define OSC2_IO              0x00E3
#define OSC2_CLKO            0x00E7

#define FRC_LO_RANGE         0x00C7
#define FRC_HI_RANGE         0x00E7

#define CSW_FSCM_ON          0x0027
#define CSW_ON_FSCM_OFF      0x0067
#define CSW_FSCM_OFF         0x00A7

/* Register FWDT (0xf8000a)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FWDT;
#define _FWDT(x) __attribute__((address(0xf8000a),deprecated_definition("consider migrating to #pragma config"),section("__FWDT.sec"),space(prog))) __prog__ uint16_t _FWDT = (x);

